# ExportLayerTableIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTableIterator Class
Members See Also
---
An iterator to a set of Layer table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLayerTableIterator : IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
```

Visual Basic
---
```text
Public Class ExportLayerTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo))
```

Visual C++
---
```text
public ref class ExportLayerTableIterator : IEnumerator<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLayerTableIterator
# See Also
ExportLayerTableIterator Members
Autodesk.Revit.DB Namespace